class ToothConstants {
  static const  List<String> caseTypeAr = [
    "حشوة ضوئية",
    "سحب عصب",
    "تلبيسة",
    "جسر أمامي",
    "جسر خلفي",
    "بدلة جزئية",
    "بدلة كاملة",
    "أطفال",
    "قلع",
    "معالجة لثوية",
    "أخرى",
  ];




  // 
  static const List<String> filterRequest=[
    "الكل",
    "نوع الحالة",
    "شدة الالم",
    "نوع السن",
  ];




  // مواقع الاسنان واسمائها
  static const Map<String, String> toothLocationMap = {
    "11": "ثنية علوية يمين",
    "12": "رباعية علوية يمين",
    "13": "ناب علوي يمين",
    "14": "ضاحك أول علوي يمين",
    "15": "ضاحك ثاني علوي يمين",
    "16": "رحى أولى علوية يمين",
    "17": "رحى ثانية علوية يمين",
    "18": "رحى ثالثة علوية يمين",
    "21": "ثنية علوية يسار",
    "22": "رباعية علوية يسار",
    "23": "ناب علوي يسار",
    "24": "ضاحك أول علوي يسار",
    "25": "ضاحك ثاني علوي يسار",
    "26": "رحى أولى علوية يسار",
    "27": "رحى ثانية علوية يسار",
    "28": "رحى ثالثة علوية يسار",
    "31": "ثنية سفلية يسار",
    "32": "رباعية سفلية يسار",
    "33": "ناب سفلي يسار",
    "34": "ضاحك أول سفلي يسار",
    "35": "ضاحك ثاني سفلي يسار",
    "36": "رحى أولى سفلية يسار",
    "37": "رحى ثانية سفلية يسار",
    "38": "رحى ثالثة سفلية يسار",
    "41": "ثنية سفلية يمين",
    "42": "رباعية سفلية يمين",
    "43": "ناب سفلي يمين",
    "44": "ضاحك أول سفلي يمين",
    "45": "ضاحك ثاني سفلي يمين",
    "46": "رحى أولى سفلية يمين",
    "47": "رحى ثانية سفلية يمين",
    "48": "رحى ثالثة سفلية يمين",
    "51": "",
    "52": "",
    "53": "",
    "54": "",
    "55": "",
    "61": "",
    "62": "",
    "63": "",
    "64": "",
    "65": "",
    "71": "",
    "72": "",
    "73": "",
    "74": "",
    "75": "",
    "81": "",
    "82": "",
    "83": "",
    "84": "",
    "85": "",
  };
  static List<String> toothLocationList=ToothConstants.toothLocationMap.keys.toList(); 
  static const sortBy=['الأقدم أولاً','الأحدث أولاً'];
  static const painSeverity=['الأقل أولاً','الأشد أولاً'];
  static List<String> painSeverityList = ["0", "1", "2", "3", "4", "5"];


}